Ran Plan for dir: `terragrunt/kubernetes/renovate` workspace: `terragrunt_kubernetes_renovate`

<details><summary>Show Output</summary>

```diff
Authenticated

03:21:01.436 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/R38B_TLMWpLpfMQoqTggfuaD7Ag/Jm5vjeYEwZBEcE_fE4tEGlltK14
03:21:01.464 INFO   tofu: Initializing the backend...
03:21:01.747 INFO   tofu: Initializing provider plugins...
03:21:01.747 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
03:21:01.915 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
03:21:01.994 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
03:21:02.106 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
03:21:02.173 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
03:21:02.262 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
03:21:02.372 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
03:21:02.482 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
03:21:02.585 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
03:21:02.618 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
03:21:02.653 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
03:21:02.673 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.4.0
03:21:02.705 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
03:21:02.720 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
03:21:02.794 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
03:21:02.815 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
03:21:02.815 INFO   tofu: OpenTofu has been successfully initialized!
03:21:03.477 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
03:21:03.477 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
03:21:03.477 STDOUT tofu:   ~ update in-place
03:21:03.477 STDOUT tofu: OpenTofu will perform the following actions:
03:21:03.477 STDOUT tofu:   # helm_release.renovate will be updated in-place
03:21:03.477 STDOUT tofu:   ~ resource "helm_release" "renovate" {
03:21:03.477 STDOUT tofu:       ~ id                         = "renovate" -> (known after apply)
03:21:03.477 STDOUT tofu:       ~ metadata                   = {
03:21:03.477 STDOUT tofu:           ~ app_version    = "40.11.17" -> (known after apply)
03:21:03.477 STDOUT tofu:           ~ chart          = "renovate" -> (known after apply)
03:21:03.477 STDOUT tofu:           ~ first_deployed = 1746674676 -> (known after apply)
03:21:03.477 STDOUT tofu:           ~ last_deployed  = 1747273054 -> (known after apply)
03:21:03.477 STDOUT tofu:           ~ name           = "renovate" -> (known after apply)
03:21:03.477 STDOUT tofu:           ~ namespace      = "renovate" -> (known after apply)
03:21:03.478 STDOUT tofu:           ~ revision       = 9 -> (known after apply)
03:21:03.478 STDOUT tofu:           ~ values         = jsonencode(
03:21:03.478 STDOUT tofu:                 {
03:21:03.478 STDOUT tofu:                   - envFrom  = [
03:21:03.478 STDOUT tofu:                       - {
03:21:03.478 STDOUT tofu:                           - secretRef = {
03:21:03.478 STDOUT tofu:                               - name = "renovate-env"
03:21:03.478 STDOUT tofu:                             }
03:21:03.478 STDOUT tofu:                         },
03:21:03.478 STDOUT tofu:                     ]
03:21:03.478 STDOUT tofu:                   - renovate = {
03:21:03.478 STDOUT tofu:                       - config = jsonencode(
03:21:03.478 STDOUT tofu:                             {
03:21:03.478 STDOUT tofu:                               - gitAuthor    = "YouHide Renovate Bot <youhide_renovate@none.com>"
03:21:03.478 STDOUT tofu:                               - platform     = "github"
03:21:03.478 STDOUT tofu:                               - repositories = [
03:21:03.478 STDOUT tofu:                                   - "youhide/hideForming",
03:21:03.478 STDOUT tofu:                                 ]
03:21:03.478 STDOUT tofu:                             }
03:21:03.478 STDOUT tofu:                         )
03:21:03.478 STDOUT tofu:                     }
03:21:03.478 STDOUT tofu:                 }
03:21:03.478 STDOUT tofu:             ) -> (known after apply)
03:21:03.478 STDOUT tofu:           ~ version        = "40.11.17" -> (known after apply)
03:21:03.478 STDOUT tofu:         } -> (known after apply)
03:21:03.478 STDOUT tofu:         name                       = "renovate"
03:21:03.478 STDOUT tofu:       ~ version                    = "40.11.17" -> "40.13.0"
03:21:03.478 STDOUT tofu:         # (26 unchanged attributes hidden)
03:21:03.478 STDOUT tofu:     }
03:21:03.478 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
03:21:03.478 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/renovate -w terragrunt_kubernetes_renovate
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Frenovate%252Fterragrunt_kubernetes_renovate)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/renovate -w terragrunt_kubernetes_renovate
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```